In [9]:
import mysql.connector as connection
import pandas as pd

try:
    mydb = connection.connect(host="localhost", user="root", passwd="mysql", use_pure=True)
    mycursor = mydb.cursor()
    query = "USE FSDS_assignment"
    mycursor.execute(query)
    print(mycursor.fetchall())
    
except Exception as e:
    mydb.close()
    print(str(e))

[]

#### 1 - Write an SQL query to fetch “FIRST_NAME” from Worker table using the alias name as WORKER_NAME.

In [20]:
query = "SELECT FIRST_NAME AS WORKER_NAME FROM WORKER"
mycursor.execute(query)
rslt = mycursor.fetchall()
df = pd.DataFrame(rslt)
print(df)

           0
0      Krish
1  Sudhanshu
2     Sanket
3     Darius
4    Sathish
5  Shaktiman

#### 2 - Write an SQL query to fetch unique values of DEPARTMENT from Worker table.

In [16]:
query = "SELECT DISTINCT DEPARTMENT_NAME FROM WORKER"
mycursor.execute(query)
rslt = mycursor.fetchall()
df = pd.DataFrame(rslt)
print(df)

             0
0  Development
1           HR
2   Accountant

#### Q-3. Write an SQL query to show the last 5 record from a table.

In [23]:
query = "SELECT * FROM WORKER ORDER BY EMPID DESC LIMIT 5"
mycursor.execute(query)
rslt = mycursor.fetchall()
df = pd.DataFrame(rslt)
print(df)

   0          1        2      3                   4            5
0  6  Shaktiman     Hero  50000 2017-12-11 09:00:00   Accountant
1  5    Sathish  Bhansal  30000 2017-10-21 09:00:00   Accountant
2  4     Darius  Bengali  70000 2015-12-13 09:00:00           HR
3  3     Sanket    Kumar  70000 2014-12-11 09:00:00           HR
4  2  Sudhanshu    Kumar  60000 2014-12-11 09:00:00  Development